#!/bin/bash
echo "#############--------功能菜单----------##############"
echo "#############--- 1、help信息-----------##############"
echo "#############----2、显示内存使用-------##############"
echo "#############----3、显示磁盘使用-------##############"
echo "#############----4、显示系统负载-------##############"
echo "#############--- 5、显示登陆用户-------##############"
echo "#############--- 6、查看ip地址---------##############"
echo "#############--- 7、查看linux-version--##############"
echo "#############--- 8、退出当前页面-------##############"
while true
  read -p "请输入需要查看的编号[1--8]:" num
  do
    case $num in 
	1)
		echo "--help信息"
		;;
	2)
		free -h
		;;
	3)
		df -h
		;;
	4)
		w|awk -F "[ ]+" 'NR==1{print $(NF-4),$(NF-3),$(NF-2),$(NF-1),$NF}'
		;;
	5)
		who
		echo "登陆总人数为：`who|wc -l`"
		;;	
	6)
		ifconfig |egrep  "^(.*)inet (.*)$"|awk '{print $2}'
		;;
	7)
		hostnamectl |awk 'NR==7;NR==9{print $0}'
		;;
	8)
		exit
		;;
	*)	
		echo "请重新输入序号"
		return true	
    esac
done







